[
  {
    "word": "Hyderabad",
    "examples": [
      "Founded by Nizam-ul-Mulk Asaf Jahan in AD 1724.",
      "His original name was Chin Qilich Khan but emperor Farrukhsiyar conferred on him the titles of ‘Khan-i-Duran’ and later ‘Nizam-ul-Mulk’.",
      "Puran Chand was his diwan.",
      "Carnatic was one of the Subah of Deccan hence, it was under Nizam of Hyderabad.",
      "Nizam of Hyderabad became independent of Delhi and deputy Governor of Carnatic made himself independent of Hyderabad, hence assumed the title ‘Nawab of Carnatic’.",
      "Saadautullah Khan of Carnatic made his nephew Dost Ali as his successor at Carnatic without the approval of Nizam. This caused rivalry between Carnatic and Hyderabad.",
      "Hyderabad remained independent until it became a part of Independent India.",
      "The Nizam provided assistance to the British during the 1857 Revolt."
    ]
  },
  {
    "word": "Awadh",
    "examples": [
      "Founded by Saadat Khan Burhan-ul-Mulk. Emperor Muhammad Shah appointed him as Governor of Awadh in AD 1722.",
      "Committed suicide in 1739 and was succeeded by his nephew Safdar Jung.",
      "The highest post of his government was held by Maharaja Nawab Rai. This shows his religious tolerance towards the Hindus."
    ]
  },
  {
    "word": "Mysore",
    "examples": [
      "Haider Ali (1761-82) started his career as a soldier in Mysore state, promoted to Commander-in-Chief and later to Faujadar at Dindigul.",
      "In 1761, he overthrew Nanjaraja and established his authority over Mysore. He established a Modern Arsenal in Dindigul.",
      "In 1769, he repeatedly defeated the British in First Anglo-Mysore War and reached the walls of Madras. He died in 1782 during Second Anglo-Mysore War.",
      "Tipu Sultan (1782-99) succeeded Haider Ali. He planted the Tree of Liberty at Srirangapatnam and became a member of the Jacobian Club.",
      "He died in 1799, fighting at the gates of Srirangapatnam during the 4th AngloMysore War.",
      "He was tolerant and enlightened in his approach towards other religions. He gave money for the construction of image of Goddess Sarda on the Shrinageri temple. The famous temple of Sri Rangnath was situated barely a hundred yards from his palace. He assumed the title of Padshah in 1797."
    ]
  },
  {
    "word": "Bengal",
    "examples": [
      "Murshid Quli Khan (1717-27) He was made Governor of Bengal (1717) and Orissa (1719). He transferred capital of Bengal from Dacca to Murshidabad. He died in 1727.",
      "Shuja-ud-din (1727-39) He was granted Governorship of Bihar by Mughal emperor Muhammad Shah Rangeela.",
      "Sarfaraz Khan (1739-40) Alivardi Khan deposed and killed Shuja-ud- din’s son, Sarfaraz Khan and made himself Nawab.",
      "Alivardi Khan (1746) Bribed Muhammad Shah Rangeela and legalised his position by receiving a farman from him. He prevented the English and French fortifications at Calcutta and Chandranagar respectively.",
      "Under the farman of 1717, the Company had rights to import or export their goods in Bengal without paying tax and right to issue passes or dastaks.",
      "In 1756, Siraj-ud-Daula seized the English factory at Kasimbazar and marched to Calcutta and occupied Fort William. Black hole tragedy took place. Robert Clive recovered Calcutta and Treaty of Alinagar was signed on 2nd January, 1757.",
      "Battle of Plassey On 23rd June, 1757, English won the battle against Siraj-ud-daula, and compelled the Nawab to concede all the demands.",
      "Mir Jafar, (Mir Bakhsh), Manik Chand (Officer incharge of Calcutta), Aminchand (rich Sikh merchant), Jagat Seth (banker), Khadim Khan (Commander of Nawab’s army) all were on the English side.",
      "Mir Madan and Mohan Lal, Nawab’s soldiers, fought bravely.",
      "Nawab was killed by Mir Jafar’s son Miran."
    ]
  },
  {
    "word": "Mir Jafar",
    "examples": [
      "Mir Jafar was the first Nawab of Bengal, Bihar and Orissa under the British rule in India.",
      "He granted free trade right to the Company in Bengal, Bihar and Orissa."
    ]
  },
  {
    "word": "Mir Qasim",
    "examples": [
      "Mir Qasim ceded Burdwan, Midnapur and Chittagong. He shifted his capital from Murshidabad to Monghyr.",
      "Mir Qasim soon revolted as he was angry with the British for misusing dastaks (free duty passes).",
      "Battle of Buxar He formed an alliance with Nawab of Awadh, Shuja-ud-daula and Mughal Emperor Shah Alam-II and fought with the British army at Buxar on 22nd October, 1764. Mir Jafar was again put on the throne by the Britishers."
    ]
  },
  {
    "word": "Treaty of Allahabad",
    "examples": [
      "English got the Diwani rights (right to collect revenue) of Bengal, Bihar and Orissa) and gave 26 lakhs.",
      "The Dual Government of Bengal was established in 1765, wherein the company got the right to collect revenue but the Nizamat right (duty of administration) was with the Nawab.",
      "After the Battle of Buxar, the Company gave Shah Alam-II a subsidary of ` 26 lakh and secured Diwani of Arrah and Allahabad.",
      "The important outcome is the Treaty of Allahabad."
    ]
  }
]
