[
indian History
e Which city rose to prominence under Martanda
Varma? — Trivandrum
e In 1750, to whom did Martanda Varma decide to
donate his kingdom? — Sri Padmanabha (Vishnu)
e Who was successor of King Martanda Varma?
; — Rama Varma
¢ By 1763, which three states absorbed all principalities in Kerala? — Cochin, Travancore and Calicut
The Rajputs
e Who was the most important Rajput ruler of the 18th century? ~ Raja Sawai Jai Singh of Amber
e Where was Raja Sawai Jai Singh born?
— Amber, the Capital of Kachhawas
e Who was the father of Raja Sawai Jai Singh?
— Raja Bishan Singh
¢ Who bestowed the title of Sawai upon Jai Singh?
— Aurangzeb
¢ Which city was founded by Raja Sawai Jai Singh?
— Jaipur
e Where did Raja Sawai Jai Singh erect his
observatories? — Delhi, Jaipur, Ujjain, Varanasi, Mathura
e Which text was translated into Sanskrit by Sawai Jai
Singh? — Euclid’s Elements of Geometry
The Jats
e Against whose policies did the Jats revolt?
— Aurangzeb e Under whose leadership did the Jats rise to power?
— Suraj Mal ° Who established the Jatt State of Bharatpur?
— Churaman and Badan Singh ¢ The Jat community played an important role in the development of the which Panth?
~ Martial Khalsa Panth of Sikhism
List of Autonomous Regional States and Its Founder
States
Bengal
Founders
Murshid Kuli Khan
Years
1717-27 AD
Carnatic Saadatullah Khan 1710-32 AD
Awadh Burhan ul Mulk (Saadat Khan)
Mysore Hyder Ali 1765-82 AD.
Travancore Marthanda Varma 1729-58 AD
|
:
;
1722-24 AD |
|
Hyderabad
Bharatpur
Chin Kilich Khan (Nizam-ul-Mulk) 1724 AD j
Churaman and Badan Singh 18th Century
Jaipur Sawai Jai Singh 18th Century |
Ruhelkhand Muhammad Khan Bangash 18th Century
Arrival of European Power in India and British Rule - :
Arrival of European in India
® In 1639 AD, which Englishman obtained permission
to build factory at Madras? — Francis Day
Which factory was built in Madras by Francis Day?
— St George
Which city replaced Masulipatnam as the
Headquarters of the English on the Coromandel
Coast? — Madras
In 1696, which Afghani plundered the city of Hooghly?
— Rahim Khan
Which incident led to the construction of Fort
William in Bengal?
_ Plundering of Hooghly by Rahim Khan
i i rt assured the security of aun = of which fo ey Bae
cutta:
t up sea trade he first European to se
ti be 4 Raia — The Portuguese (UKPSC 2004)
Which was the last European Company to establish
5 ia in 1664 AD? power in India in C isan eaet India Company
The Portuguese
e When was the first European company arrived in
India? — 1498 AD
e Most European powers reached India after crossing
the — Cape of Good Hope
* Where was the first Headquarters of Portuguese East
India Company located? — Cochin
India was discovered by which Portuguese traveller?
— Vasco-da-Gama
Who were the first Europeans to come to India for
trade? — Portuguese (UPPSC 2007)
In which year, Vasco-da-Gama arrived in Calicut?
— 1498 AD (CGPSC 2004)
Which was the first European power to follow the
mercantilist policy in India? — The Portuguese
Who among the following had welcomed Vasco-da- Gama in Calicut? — Zamorin (UP Lower 2013)
With whose help did Vasco-da-Gama reach Asia?
~ Ibn Majid
66
e In which year did Vasco-da-Gama revisit India? — 1502
e Which Portuguese traveller arrived in India after
Vasco-da-Gama? — Lopo Soares
e Which port was monopolised by Portuguese for trade
— Malabar Coast purposes?
® What was the main objective of Portuguese trade in
India? — Spice Trade
© Who was the first Portuguese Viceroy in India?
_ Francisco de Almeida (BPSC 2001)
e In which year did Portuguese. capture Goa?
— 1510 AD (IAS 2003)
e Which one of the following is connected with Blue
Water Policy? _Francisco De Almeida (UKPSC 2016)
e Who was the real founder of Portuguese power in
India? — Alfonso de Albuquerque (UP Lower Sub 2013)
e Which was the most important achievement of
Albuquerque? —Annexation of Goa from Sultan of Bijapur
© The foundation of Portuguese maritime empire in
India was laid under Albuquerque when
— Portuguese were successful in capturing
Calicut and Cochin
e Albuquerque maintained friendly relations with which
Empire? — — Vijayanagar
e At which place did Portuguese build their first
fortress? — Anjidiva (UPPCS 2010)
e Who shifted the Portuguese Capital from Cochin to
Goa?P — Nino da Cunha
e Among the factories in Bengal, the one established. by
Portuguese was — Hooghly (UPPSC 2004)
e From which ruler did Portuguese obtain permission to
set up factory in Bengal? — Ghiyasuddin Mahmud Shah
Hooghly was used as the base for piracy in the Bay of
Bengal by — Portuguese (IAS 1995)
The Dutch
e in which year was the Dutch United East India
Company formed? — 1602 AD
e What was the original name of Dutch United East
India Company?
e The first to start a Joint Stock Company to trade with
— Dutch (IAS 1994) India were
List of Factories Established by Dutch
ew Year of Establishmer t
sural 1616 AD
Bimilipatnam (Bheemunipatnam) 1641 AD
Karaikal 1645 AD
Chinsura 1663 AD
Balasore and Nagpattinam 1658 AD
Kochin 1663 AD
Dp eee PN IIT
~ Veeringde Oostindische Compagnie
NCERT One Liner = General st
e Dutch.East India Company established its factory in em
Patna in which year? — 1632 (BPSc 2019)
Who promoted the export of textiles instead of spices?
~ The Dutch
e Which port belonged to Dutch? . — Vengurla Poy
° By whom did Dutch defeat and built Fort William in
Modern Kochi? — Portuguese (IAS 2005)
Which was the factory founded by the Dutch at
Devanamapattnam? — Fort St David
e Which was the main centre for the Dutch after
; — Nagapattinam Pulicat?
e Which factories of Bengal were established by the
Dutch? — Chinsurah and Hooghly (UP Lower 2010)
The English
® Who was the first English merchant to come to India
for trade? — John Mildenhall
e Which was the first English ship that came to India?
— Red Dragon
e Under whose authority did East India Company’s
voyage to India take place? — Captain William Hawkins
e In 1600, the Charter to English East India Company
for monopoly of Eastern trade for fifteen years was
given by — Queen Elizabeth I
e Which company was formed by the Charter granted by
Queen Elizabeth I in1600? ;
~ Governor and Company of Merchants of London
Trading into the East Indies
e Which group was responsible for the formation of East
India Company? _ — Merchant Adventures in England
e Which British company got the first Charter
permitting them to trade to India?
— East India Company (UPPSC 2014)
3 Who was the Emperor of the India when British East
India Company was formed in India? ~
; | — Akbar (UPPSC 201)
¢ During the time of which Mughal Emperor did the
pate ee India Company establish its first factory
ew neat ey ~ Jahangir (IAS 2002)
hich commodities did the East India company aim t acquire in Eastern Archipelago? — Spices and Pepp*
ie The first two voyages of the East India Company wer aa ieee ~ Achin and Bantam
° The Englishman appointed by Akbar for verification diamonds was * _ William Leeds
e Which of the following British offici
Portuguese at Sollwey? miami
— Captain William Hawkins (BPSC 2000)
e Who was the Emperor of India when the British East
India Company formed in London? xe ) ce — Jahangir (UPPSC 2012! i
e In 1611, which English Trader got the permission tO
f _ trade from the Mughal Governor?
— Captain John Middleto”
indian History
e Under whose authority did British mission succeed to
obtain Farman from Mughal Emperor Jahangir?
— Sir Thomas Roe
e Where in India did Britishers set up their first factory
in 1613? — Surat (UPPSC (GIC) 2010)
e Bombay was taken over by the East India Company
from : — The Portuguese (UKPSC 2010)
e Which English Governor of East India Company was
expelled by Aurangzeb? — Sir John Child (MPPSC 2008)
e In which year did English East India Company receive
permission to trade in Masulipatnam? — 1611 AD
e Who was Sir George Oxenden? — First Governor of
Bombay and Responsible for its Rise into Prominence
e Identify the region from where Europeans got best
shora (saltepetre) and opium? — Bihar (BPSC 2005)
e Fort St. George (white town), the first English British
Fortress in India was founded at which state?
. — Madras
e During whose reign did Sir Thomas Roe had regular
attendance at the Mughal Court to secure, commercial
privileges? — Jahangir
e Which Emperor rewarded the Golden Farman to the
Company in 1632 AD? — Sultan of Golconda
¢ Which was the main port of Golconda? -—- Masulipatnam
e Which Bengali goods were in high demand in
England? — Silk and Saltpetre
e In 1663, where did the Orissa’s Governor grant the
permission to English merchants to establish their
factories? — Hariharpur, Balasore and Pipli
¢ In 1770 AD, which area was constituted as the
separate Presidency by the Company? — Bengal
¢ Who was the first President of Independent Bengal
— Sir Charles Ayer
o the court of
— John Surman
Presidency?
® Who led the diplomatic mission t
Farrukh Siyar in 1717 AD?
The French
i to ® Who was the last European to come
pre-Independent India as traders? _— French (IAS 2007)
ef i idered the founder of French Company in
Sie a — Jean-Baptiste Colbert (UPPSC 2003)
s ‘constituted during , any wa * French East India Company We" is XIV (UPPSC 2014) .
the ti f Aaa home near Madras?
© In 1672, who occupied Sant REP gc
e mi vl Be obtained by Francois Mare poche
e iy Benen: ine French laid the foundation b eh
* In India 7 French established their ai i HS
at
— English had a Strong
Carnatic Wars in India
7 4 ° During whose , Governorship did the Mench power in India rose to its peak? hig Dupleix ' @ Carnatic Wars were fought between
~ English and French (UPPSC 1995)
® How many Carnatic Wars were fought between English and the French? ~ Three
¢ Due to which war in Europe, First Carnatic War took place in India? — War of Austrian Succession
e Which was the immediate cause of first Carnatic War?
— Capture of French Ships by the British (BPSC 2000)
e When did the First Carnatic War take place India?
— 1740-48 AD
® Which treaty brought the First Carnatic War to end?
— Treaty of Aix-la-Chapelle (UPPSC 2016)
e To whom did the French support for Nawabship?
— Chanda Sahib
e Who were defeated in the Second Carintie War?
~— The French
e Who was recognised as the Nawab of Carnatic after
the Second Carnatic War? — Muhammad Ali
e The famous Battle of Wandiwash in 1760 was
fought by British against whom?
— The French (66th BPSC 2020)
e¢ What was the outcome of 1760 battle of Wandiwash?
_ British Defeated the French (UPPSC 2015)
se Name the French Commander, who was defeated in ©
the Battle of Wandiwash in 1760. — Count Lally
e Which treaty ended the seven years war in Europe?
— Treaty of Paris
| List of Carnatic Wars
| War Period Causes | Comsequences
Ist 1746 War ofthe With the termination of
' Carnatic -48AD Austrian the War of Austrian
| War Succession Succession in Europe,
the First Carnatic War
also came to an end.
2nd 1749 War of The war ended with
Carnatic -54AD Succession the Treaty of Pondicherry,
War in signed in 1754, which
Karnataka recognised Muhammad
Ali Khan Walajah as
the Nawab of the
Carnatic:
3rd 1756-63 Seven Years’ The French agreed to
Carnatic AD War support British client
War governments, thus
ending French ambitions
of an Indian empire and
making the British the
dominant foreign power
in India. 
]